# Text Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..String..::..Text Property
SpecTypeId..::..String Class See Also
---
Text, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Text { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Text As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Text {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId..::..String Class
Autodesk.Revit.DB Namespace